[
  { "q": "Czym jest Interview Prep i jak działa analiza?", "a": "To narzędzie oparte na AI, które porównuje treść Twojego CV z ogłoszeniem o pracę. System klasyfikuje branżę CV i ogłoszenia, liczy overlap słów kluczowych oraz generuje podsumowanie, mocne/słabe strony i pytania do rozmowy." },
  { "q": "Dlaczego czasem widzę ostrzeżenie o niedopasowaniu (warning_mismatch)?", "a": "Gdy branża/rola z CV różni się od branży/roli z ogłoszenia (np. CV: Finanse, JD: DevOps), backend nadaje priorytet ogłoszeniu, wyświetla ostrzeżenie i proponuje kroki uzupełniające (np. dodanie projektów/stacku)." },
  { "q": "Ile pytań dostanę w planie Free i Pro?", "a": "Plan Free: 2 pytania miękkie + 2 twarde (łącznie 4). Plan Pro: 7 pytań miękkich + 10 twardych (łącznie 17). Liczba jest twardo ograniczana po stronie serwera." },
  { "q": "Czy mogę dodać kilka ogłoszeń naraz?", "a": "Tak. W planie Free można przeanalizować 1 ogłoszenie na raz, w planie Pro — do 5. System scala ich treści i tworzy wspólną analizę." },
  { "q": "Co oznacza procent dopasowania?", "a": "To heurystyczny wskaźnik oparty m.in. na bilansie mocnych stron vs obszarów do poprawy oraz na overlapie słów kluczowych. Przy bardzo niskim overlapie stosujemy ograniczenie (cap), by wynik nie był sztucznie zawyżony." },
  { "q": "Czy moje CV jest przechowywane na serwerze?", "a": "Plik CV jest przetwarzany w locie i usuwany po odczycie. Historia analiz zapisywana jest lokalnie w Twojej przeglądarce (localStorage). Szczegóły znajdziesz w Polityce prywatności." },
  { "q": "Jak chronione są moje dane?", "a": "Korzystamy z renomowanych dostawców (hosting, AI, analityka). Mamy ograniczenia rozmiaru, walidację i logowanie błędów. Formularz kontaktowy posiada rate limit, honeypot i walidację e-mail. Zobacz Politykę prywatności." },
  { "q": "Co jeśli model zwróci odpowiedź w niepoprawnym formacie?", "a": "Backend ma parser z fallbackiem oraz twarde cięcia długości. W skrajnych przypadkach pokazujemy skrót surowej odpowiedzi i prosimy o ponowienie analizy lub kontakt." },
  { "q": "Jak działa wariant A/B?", "a": "Możesz wymusić wariant URL-em ?ab=0 (A) lub ?ab=1 (B). Wariant B stosuje ograniczenie procentu dopasowania przy niskim overlapie słów kluczowych. Wydarzenia zbieramy w Plausible jako „analysis_completed”." },
  { "q": "Jak mogę poprawić dopasowanie do stanowiska?", "a": "Dodaj projekty/stack zgodne z ogłoszeniem (np. Docker/Kubernetes/Terraform dla DevOps), podkreśl transferowalne kompetencje i zaktualizuj sekcję umiejętności w CV." },
  { "q": "Czy planujecie funkcje płatne?", "a": "Tak. Wersja Pro obejmuje więcej ogłoszeń, bogatsze pytania, eksport PDF/portfolio i wkrótce symulację rozmowy. Ceny i zakres będziemy ogłaszać w Regulaminie i na stronie cennika." },
  { "q": "Nie działa import ogłoszenia — co zrobić?", "a": "Wklej treść oferty ręcznie do pola „Dodatkowy opis” lub spróbuj innego linku. Niektóre portale mają ochrony anty-scrapingowe. Jeśli problem się powtarza, skontaktuj się przez formularz." },
  { "q": "Jak skontaktować się z zespołem?", "a": "Użyj strony Kontakt — odpowiedź dostaniesz na podany e-mail. W sprawach danych osobowych też skorzystaj z formularza (temat: RODO)." }
]
